Ran Plan for dir: `terragrunt-integration/terraform` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'terragrunt plan --all' in '/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/29/default/terragrunt-integration/terraform': exit status 1: running "terragrunt plan --all" in "/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/29/default/terragrunt-integration/terraform": 
12:03:56.940 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit .
- Unit ./modules/random

Group 2
- Unit ./app1/dev
- Unit ./app1/prod
- Unit ./app2/dev
- Unit ./app2/prod


12:03:57.122 STDOUT [modules/random] terraform: Terraform used the selected providers to generate the following execution
12:03:57.122 STDOUT [modules/random] terraform: plan. Resource actions are indicated with the following symbols:
12:03:57.122 STDOUT [modules/random] terraform:   + create
12:03:57.122 STDOUT [modules/random] terraform: Terraform will perform the following actions:
12:03:57.122 STDOUT [modules/random] terraform:   # random_string.base_bucket_name will be created
12:03:57.123 STDOUT [modules/random] terraform:   + resource "random_string" "base_bucket_name" {
12:03:57.123 STDOUT [modules/random] terraform:       + id          = (known after apply)
12:03:57.123 STDOUT [modules/random] terraform:       + length      = 4
12:03:57.123 STDOUT [modules/random] terraform:       + lower       = true
12:03:57.123 STDOUT [modules/random] terraform:       + min_lower   = 0
12:03:57.123 STDOUT [modules/random] terraform:       + min_numeric = 0
12:03:57.123 STDOUT [modules/random] terraform:       + min_special = 0
12:03:57.123 STDOUT [modules/random] terraform:       + min_upper   = 0
12:03:57.123 STDOUT [modules/random] terraform:       + number      = false
12:03:57.123 STDOUT [modules/random] terraform:       + numeric     = false
12:03:57.123 STDOUT [modules/random] terraform:       + result      = (known after apply)
12:03:57.123 STDOUT [modules/random] terraform:       + special     = false
12:03:57.123 STDOUT [modules/random] terraform:       + upper       = false
12:03:57.123 STDOUT [modules/random] terraform:     }
12:03:57.123 STDOUT [modules/random] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
12:03:57.123 STDOUT [modules/random] terraform: 
12:03:57.123 STDOUT [modules/random] terraform: Changes to Outputs:
12:03:57.123 STDOUT [modules/random] terraform:   + base_bucket_name = (known after apply)
12:03:57.123 STDOUT terraform: Terraform used the selected providers to generate the following execution
12:03:57.123 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
12:03:57.123 STDOUT terraform:   + create
12:03:57.123 STDOUT terraform: Terraform will perform the following actions:
12:03:57.123 STDOUT terraform:   # random_string.base_bucket_name will be created
12:03:57.123 STDOUT terraform:   + resource "random_string" "base_bucket_name" {
12:03:57.123 STDOUT terraform:       + id          = (known after apply)
12:03:57.123 STDOUT terraform:       + length      = 4
12:03:57.123 STDOUT terraform:       + lower       = true
12:03:57.123 STDOUT terraform:       + min_lower   = 0
12:03:57.123 STDOUT terraform:       + min_numeric = 0
12:03:57.123 STDOUT terraform:       + min_special = 0
12:03:57.123 STDOUT terraform:       + min_upper   = 0
12:03:57.123 STDOUT terraform:       + number      = false
12:03:57.123 STDOUT terraform:       + numeric     = false
12:03:57.123 STDOUT terraform:       + result      = (known after apply)
12:03:57.123 STDOUT terraform:       + special     = false
12:03:57.123 STDOUT terraform:       + upper       = false
12:03:57.123 STDOUT terraform:     }
12:03:57.123 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
12:03:57.123 STDOUT terraform: 
12:03:57.124 STDOUT terraform: Changes to Outputs:
12:03:57.124 STDOUT terraform:   + base_bucket_name = (known after apply)
12:03:57.174 WARN   [app2/prod] Config ./commons.hcl is a dependency of ./app2/prod/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
12:03:57.174 WARN   [app1/dev] Config ./commons.hcl is a dependency of ./app1/dev/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
12:03:57.175 INFO   [app1/dev] Downloading Terraform configurations from ./app1/modules/s3-bucket into ./app1/dev/.terragrunt-cache/Dy24elOkyWlx39oUNSN1sUWPWdE/7wza7cdZCs6QRBja-vVaN8meMGs
12:03:57.175 ERROR  [app1/dev] Unit ./app1/dev has finished with an error
12:03:57.175 INFO   [app2/prod] Downloading Terraform configurations from ./app2/modules/s3-bucket into ./app2/prod/.terragrunt-cache/fP1H2iLeTQTMihuXGAKgGEeT9HE/97tR37WQs1WcY_wZe7K4sUdhe_4
12:03:57.175 ERROR  [app2/prod] Unit ./app2/prod has finished with an error
12:03:57.174 WARN   [app2/dev] Config ./commons.hcl is a dependency of ./app2/dev/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
12:03:57.174 WARN   [app1/prod] Config ./commons.hcl is a dependency of ./app1/prod/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
12:03:57.175 INFO   [app2/dev] Downloading Terraform configurations from ./app2/modules/s3-bucket into ./app2/dev/.terragrunt-cache/f1DwfIKiP2WBVZ043on2qmsJrJw/97tR37WQs1WcY_wZe7K4sUdhe_4
12:03:57.176 ERROR  [app2/dev] Unit ./app2/dev has finished with an error
12:03:57.176 INFO   [app1/prod] Downloading Terraform configurations from ./app1/modules/s3-bucket into ./app1/prod/.terragrunt-cache/-UrPdAhcofBiwdvgNB96g0spBl8/7wza7cdZCs6QRBja-vVaN8meMGs
12:03:57.176 ERROR  [app1/prod] Unit ./app1/prod has finished with an error
12:03:57.176 ERROR  Run failed: 4 errors occurred:

* downloading source url file:///home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/29/default/terragrunt-integration/terraform/app1/modules/s3-bucket
  error occurred:
  
  * stat ./app1/modules/s3-bucket: no such file or directory
  

* downloading source url file:///home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/29/default/terragrunt-integration/terraform/app1/modules/s3-bucket
  error occurred:
  
  * stat ./app1/modules/s3-bucket: no such file or directory
  

* downloading source url file:///home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/29/default/terragrunt-integration/terraform/app2/modules/s3-bucket
  error occurred:
  
  * stat ./app2/modules/s3-bucket: no such file or directory
  

* downloading source url file:///home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/29/default/terragrunt-integration/terraform/app2/modules/s3-bucket
  error occurred:
  
  * stat ./app2/modules/s3-bucket: no such file or directory
  



```
</details>